# ExportFontTable Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportFontTable Properties
ExportFontTable Class See Also
---
The ExportFontTable type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Count | Count of the items contained in the collection. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Item | A copy of the ExportFontInfo for the font's ExportFontKey. |

# See Also
ExportFontTable Class
Autodesk.Revit.DB Namespace